#Область ПрограммныйИнтерфейс 
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить команды.
//   Добавляет на форму поля и команды
//
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеВГруппаШапкаПраво(Форма);
		ДобавитьГруппуСкидкиШапкаЛево(форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(форма);
		ДобавитьКнопкуВГруппаСкидки(форма);	
	ИначеЕсли Имяформы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма);		
	
	КонецЕсли;	
	        
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить команды.
//   Добавляет на форму поля и команды
Процедура  ДобавитьПолеВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить ("КонтактноеЛицо", Тип("Полеформы"), Форма.Элементы.ГруппаШапкаПраво); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";

КонецПроцедуры

Процедура  ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить ("КонтактноеЛицо", Тип("Полеформы"), ,Форма.Элементы.СуммаДокумента); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";

КонецПроцедуры

Процедура  ДобавитьГруппуСкидкиШапкаЛево(форма) 
	
	ГруппаФормы = Форма.Элементы.Добавить ("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаКолонкиШапки.ПодчиненныеЭлементы.ГруппаШапкаЛево); 
	ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
	ГруппаФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаФормы.ОтображатьЗаголовок = ЛОЖЬ; 
	
КонецПроцедуры   

Процедура  ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(форма) 
	
	ПолеВвода = Форма.Элементы.Добавить ("СогласованнаяСкидка", Тип("Полеформы"), Форма.Элементы.ГруппаСкидка); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка"; 
	ПолеВвода.УстановитьДействие("ПриИзменении", "ДЗ_СогласованнаяСкидкаПриИзменении");
	
КонецПроцедуры   

Процедура  ДобавитьКнопкуВГруппаСкидки(форма)
	
	Команда = Форма.Команды.Добавить("ДЗ_ПересчитатьСуммы");
	Команда.Действие = "ДЗ_ПересчитатьСуммы";
	Команда.Заголовок = "Пересчитать таблицу";
	Кнопка = Форма.Элементы.Добавить("ПересчитатьТаблицы", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидка);
	Кнопка.ИмяКоманды = "ДЗ_ПересчитатьСуммы";
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	                                      
КонецПроцедуры

#КонецОбласти

